mailfunnels-server/app/controllers/apps_controller.rb

	def index
		logger.info "Using App.Index Controller"

		if params.has_key?(:name)
			@app = App.where(name: params[:name])
---
SELECT "apps".* FROM "apps" WHERE "apps"."name" = $1  [["name", "Streich-Tillman"]]

	def create
		@app = App.new(app_params)

		if @app.save
---
INSERT INTO "apps" ("name", "api_key", "api_secret", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Funk LLC"], ["api_key", ""], ["api_secret", "447314902980479"], ["created_at", 2016-12-24 08:17:37 UTC], ["updated_at", 2016-12-24 08:17:37 UTC], ["auth_token", "305444827120496"]]

	def update
		if @app.update(app_params)
---
UPDATE "apps" SET "api_key" = $1, "updated_at" = $2 WHERE "apps"."id" = $3  [["api_key", "RANDOM"], ["updated_at", 2016-12-24 08:17:37 UTC], ["id", 5]]

	def destroy
		@app.destroy
---
DELETE FROM "apps" WHERE "apps"."id" = $1  [["id", 8]]

	def set_app
		@app = App.find(params[:id])
---
SELECT  "apps".* FROM "apps" WHERE "apps"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]