mailfunnels-server/app/controllers/email_lists_controller.rb

SELECT "email_lists".* FROM "email_lists" WHERE "email_lists"."app_id" = $1  [["app_id", nil]]
---
  def index
    @email_lists = EmailList.all

INSERT INTO "email_lists" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "MyName"], ["description", "MyDescription"], ["created_at", 2016-12-24 08:17:37 UTC], ["updated_at", 2016-12-24 08:17:37 UTC]]
---
  def create
    @email_list = EmailList.new(email_list_params)

    if @email_list.save

UPDATE "email_lists" SET "description" = $1, "updated_at" = $2 WHERE "email_lists"."id" = $3  [["description", "NewAttributeDescription"], ["updated_at", 2016-12-24 08:17:37 UTC], ["id", 6]]
---
  def update
    if @email_list.update(email_list_params)

DELETE FROM "email_lists" WHERE "email_lists"."id" = $1  [["id", 9]]
---
  def destroy
    @email_list.destroy

SELECT  "email_lists".* FROM "email_lists" WHERE "email_lists"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_email_list
      @email_list = EmailList.find(params[:id])